probe-rs/probe-rs-debugger-test/svd_files/nRF52833_xxAA.svd
        <register>
          <name>RESETREAS</name>
          <description>Reset reason</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RESETPIN</name>
              <description>Reset from pin-reset detected</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOG</name>
              <description>Reset from watchdog detected</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SREQ</name>
              <description>Reset from soft reset detected</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCKUP</name>
              <description>Reset from CPU lock-up detected</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFF</name>
              <description>Reset due to wake up from System OFF mode when wakeup is triggered from DETECT signal from GPIO</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPCOMP</name>
              <description>Reset due to wake up from System OFF mode when wakeup is triggered from ANADETECT signal from LPCOMP</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIF</name>
              <description>Reset due to wake up from System OFF mode when wakeup is triggered from entering into debug interface mode</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NFC</name>
              <description>Reset due to wake up from System OFF mode by NFC field detect</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS</name>
              <description>Reset due to wake up from System OFF mode by VBUS rising into valid range</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotDetected</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Detected</name>
                  <description>Detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMSTATUS</name>
          <description>Deprecated register - RAM status register</description>
          <addressOffset>0x428</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>RAMBLOCK0</name>
              <description>RAM block 0 is on or off/powering up</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMBLOCK1</name>
              <description>RAM block 1 is on or off/powering up</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMBLOCK2</name>
              <description>RAM block 2 is on or off/powering up</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMBLOCK3</name>
              <description>RAM block 3 is on or off/powering up</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Off</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>On</name>
                  <description>On</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USBREGSTATUS</name>
          <description>USB supply status</description>
          <addressOffset>0x438</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VBUSDETECT</name>
              <description>VBUS input detection status (USBDETECTED and USBREMOVED events are derived from this information)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoVbus</name>
                  <description>VBUS voltage below valid threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VbusPresent</name>
                  <description>VBUS voltage above valid threshold</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTPUTRDY</name>
              <description>USB supply output settling time elapsed</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotReady</name>
                  <description>USBREG output settling time not elapsed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>USBREG output settling time elapsed (same information as USBPWRRDY event)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSTEMOFF</name>
          <description>System OFF register</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSTEMOFF</name>
              <description>Enable System OFF mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enter</name>
                  <description>Enable System OFF mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POFCON</name>
          <description>Power-fail comparator configuration</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POF</name>
              <description>Enable or disable power failure warning</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>Power-fail comparator threshold setting. This setting applies both for normal voltage mode (supply connected to both VDD and VDDH) and high voltage mode (supply connected to VDDH only). Values 0-3 set threshold below 1.7 V and should not be used as brown out detection will be activated before power failure warning on such low voltages.</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V17</name>
                  <description>Set threshold to 1.7 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V18</name>
                  <description>Set threshold to 1.8 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V19</name>
                  <description>Set threshold to 1.9 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V20</name>
                  <description>Set threshold to 2.0 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V21</name>
                  <description>Set threshold to 2.1 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V22</name>
                  <description>Set threshold to 2.2 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V23</name>
                  <description>Set threshold to 2.3 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V24</name>
                  <description>Set threshold to 2.4 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V25</name>
                  <description>Set threshold to 2.5 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V26</name>
                  <description>Set threshold to 2.6 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V27</name>
                  <description>Set threshold to 2.7 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V28</name>
                  <description>Set threshold to 2.8 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLDVDDH</name>
              <description>Power-fail comparator threshold setting for high voltage mode (supply connected to VDDH only). This setting does not apply for normal voltage mode (supply connected to both VDD and VDDH).</description>
              <lsb>8</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V27</name>
                  <description>Set threshold to 2.7 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V28</name>
                  <description>Set threshold to 2.8 V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V29</name>
                  <description>Set threshold to 2.9 V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V30</name>
                  <description>Set threshold to 3.0 V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V31</name>
                  <description>Set threshold to 3.1 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V32</name>
                  <description>Set threshold to 3.2 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V33</name>
                  <description>Set threshold to 3.3 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V34</name>
                  <description>Set threshold to 3.4 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V35</name>
                  <description>Set threshold to 3.5 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V36</name>
                  <description>Set threshold to 3.6 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V37</name>
                  <description>Set threshold to 3.7 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V38</name>
                  <description>Set threshold to 3.8 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V39</name>
                  <description>Set threshold to 3.9 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V40</name>
                  <description>Set threshold to 4.0 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V41</name>
                  <description>Set threshold to 4.1 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V42</name>
                  <description>Set threshold to 4.2 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPREGRET</name>
          <description>General purpose retention register</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPREGRET</name>
              <description>General purpose retention register</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>GPREGRET2</name>
          <description>General purpose retention register</description>
          <addressOffset>0x520</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPREGRET</name>
              <description>General purpose retention register</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCEN</name>
          <description>Enable DC/DC converter for REG1 stage</description>
          <addressOffset>0x578</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DCDCEN</name>
              <description>Enable DC/DC converter for REG1 stage.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAINREGSTATUS</name>
          <description>Main supply status</description>
          <addressOffset>0x640</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAINREGSTATUS</name>
              <description>Main supply status</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal voltage mode. Voltage supplied on VDD.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>High voltage mode. Voltage supplied on VDDH.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
