probe-rs/probe-rs-debugger-test/svd_files/nRF52833_xxAA.svd
        <register>
          <name>PSEL</name>
          <description>Pin select</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSEL</name>
              <description>Analog pin select</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AnalogInput0</name>
                  <description>AIN0 selected as analog input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput1</name>
                  <description>AIN1 selected as analog input</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput2</name>
                  <description>AIN2 selected as analog input</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput3</name>
                  <description>AIN3 selected as analog input</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput4</name>
                  <description>AIN4 selected as analog input</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput5</name>
                  <description>AIN5 selected as analog input</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput6</name>
                  <description>AIN6 selected as analog input</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogInput7</name>
                  <description>AIN7 selected as analog input</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REFSEL</name>
          <description>Reference source select for single-ended mode</description>
          <addressOffset>0x508</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>Reference select</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Int1V2</name>
                  <description>VREF = internal 1.2 V reference (VDD &amp;gt;= 1.7 V)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Int1V8</name>
                  <description>VREF = internal 1.8 V reference (VDD &amp;gt;= VREF + 0.2 V)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Int2V4</name>
                  <description>VREF = internal 2.4 V reference (VDD &amp;gt;= VREF + 0.2 V)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDD</name>
                  <description>VREF = VDD</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARef</name>
                  <description>VREF = AREF</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTREFSEL</name>
          <description>External reference select</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EXTREFSEL</name>
              <description>External analog reference select</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AnalogReference0</name>
                  <description>Use AIN0 as external analog reference</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference1</name>
                  <description>Use AIN1 as external analog reference</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference2</name>
                  <description>Use AIN2 as external analog reference</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference3</name>
                  <description>Use AIN3 as external analog reference</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference4</name>
                  <description>Use AIN4 as external analog reference</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference5</name>
                  <description>Use AIN5 as external analog reference</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference6</name>
                  <description>Use AIN6 as external analog reference</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AnalogReference7</name>
                  <description>Use AIN7 as external analog reference</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TH</name>
          <description>Threshold configuration for hysteresis unit</description>
          <addressOffset>0x530</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>THDOWN</name>
              <description>VDOWN = (THDOWN+1)/64*VREF</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>THUP</name>
              <description>VUP = (THUP+1)/64*VREF</description>
              <lsb>8</lsb>
              <msb>13</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>Mode configuration</description>
          <addressOffset>0x534</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SP</name>
              <description>Speed and power modes</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Low-power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Normal</name>
                  <description>Normal mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>High-speed mode</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAIN</name>
              <description>Main operation modes</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE</name>
                  <description>Single-ended mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Diff</name>
                  <description>Differential mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HYST</name>
          <description>Comparator hysteresis enable</description>
          <addressOffset>0x538</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HYST</name>
              <description>Comparator hysteresis</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoHyst</name>
                  <description>Comparator hysteresis disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Hyst50mV</name>
                  <description>Comparator hysteresis enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
