probe-rs/probe-rs-debugger-test/svd_files/nRF52833_xxAA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FPU</name>
      <description>FPU</description>
      <baseAddress>0x40026000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FPU</name>
        <value>38</value>
      </interrupt>
      <groupName>FPU</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USBD</name>
      <description>Universal serial bus device</description>
      <baseAddress>0x40027000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USBD</name>
        <value>39</value>
      </interrupt>
      <groupName>USBD</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_STARTEPIN[%s]</name>
          <description>Description collection: Captures the EPIN[n].PTR and EPIN[n].MAXCNT registers values, and enables endpoint IN n to respond to traffic from host</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTEPIN</name>
              <description>Captures the EPIN[n].PTR and EPIN[n].MAXCNT registers values, and enables endpoint IN n to respond to traffic from host</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STARTISOIN</name>
          <description>Captures the ISOIN.PTR and ISOIN.MAXCNT registers values, and enables sending data on ISO endpoint</description>
          <addressOffset>0x024</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTISOIN</name>
              <description>Captures the ISOIN.PTR and ISOIN.MAXCNT registers values, and enables sending data on ISO endpoint</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TASKS_STARTEPOUT[%s]</name>
          <description>Description collection: Captures the EPOUT[n].PTR and EPOUT[n].MAXCNT registers values, and enables endpoint n to respond to traffic from host</description>
          <addressOffset>0x028</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTEPOUT</name>
              <description>Captures the EPOUT[n].PTR and EPOUT[n].MAXCNT registers values, and enables endpoint n to respond to traffic from host</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_STARTISOOUT</name>
          <description>Captures the ISOOUT.PTR and ISOOUT.MAXCNT registers values, and enables receiving of data on ISO endpoint</description>
          <addressOffset>0x048</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_STARTISOOUT</name>
              <description>Captures the ISOOUT.PTR and ISOOUT.MAXCNT registers values, and enables receiving of data on ISO endpoint</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_EP0RCVOUT</name>
          <description>Allows OUT data stage on control endpoint 0</description>
          <addressOffset>0x04C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_EP0RCVOUT</name>
              <description>Allows OUT data stage on control endpoint 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_EP0STATUS</name>
          <description>Allows status stage on control endpoint 0</description>
          <addressOffset>0x050</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_EP0STATUS</name>
              <description>Allows status stage on control endpoint 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_EP0STALL</name>
          <description>Stalls data and status stage on control endpoint 0</description>
          <addressOffset>0x054</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_EP0STALL</name>
              <description>Stalls data and status stage on control endpoint 0</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DPDMDRIVE</name>
          <description>Forces D+ and D- lines into the state defined in the DPDMVALUE register</description>
          <addressOffset>0x058</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DPDMDRIVE</name>
              <description>Forces D+ and D- lines into the state defined in the DPDMVALUE register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_DPDMNODRIVE</name>
          <description>Stops forcing D+ and D- lines into any state (USB engine takes control)</description>
          <addressOffset>0x05C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_DPDMNODRIVE</name>
              <description>Stops forcing D+ and D- lines into any state (USB engine takes control)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_USBRESET</name>
          <description>Signals that a USB reset condition has been detected on USB lines</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_USBRESET</name>
              <description>Signals that a USB reset condition has been detected on USB lines</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_STARTED</name>
          <description>Confirms that the EPIN[n].PTR and EPIN[n].MAXCNT, or EPOUT[n].PTR and EPOUT[n].MAXCNT registers have been captured on all endpoints reported in the EPSTATUS register</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_STARTED</name>
              <description>Confirms that the EPIN[n].PTR and EPIN[n].MAXCNT, or EPOUT[n].PTR and EPOUT[n].MAXCNT registers have been captured on all endpoints reported in the EPSTATUS register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_ENDEPIN[%s]</name>
          <description>Description collection: The whole EPIN[n] buffer has been consumed. The buffer can be accessed safely by software.</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ENDEPIN</name>
              <description>The whole EPIN[n] buffer has been consumed. The buffer can be accessed safely by software.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_EP0DATADONE</name>
          <description>An acknowledged data transfer has taken place on the control endpoint</description>
          <addressOffset>0x128</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_EP0DATADONE</name>
              <description>An acknowledged data transfer has taken place on the control endpoint</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ENDISOIN</name>
          <description>The whole ISOIN buffer has been consumed. The buffer can be accessed safely by software.</description>
          <addressOffset>0x12C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ENDISOIN</name>
              <description>The whole ISOIN buffer has been consumed. The buffer can be accessed safely by software.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_ENDEPOUT[%s]</name>
          <description>Description collection: The whole EPOUT[n] buffer has been consumed. The buffer can be accessed safely by software.</description>
          <addressOffset>0x130</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ENDEPOUT</name>
              <description>The whole EPOUT[n] buffer has been consumed. The buffer can be accessed safely by software.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_ENDISOOUT</name>
          <description>The whole ISOOUT buffer has been consumed. The buffer can be accessed safely by software.</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_ENDISOOUT</name>
              <description>The whole ISOOUT buffer has been consumed. The buffer can be accessed safely by software.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SOF</name>
          <description>Signals that a SOF (start of frame) condition has been detected on USB lines</description>
          <addressOffset>0x154</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_SOF</name>
              <description>Signals that a SOF (start of frame) condition has been detected on USB lines</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_USBEVENT</name>
          <description>An event or an error not covered by specific events has occurred. Check EVENTCAUSE register to find the cause.</description>
          <addressOffset>0x158</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_USBEVENT</name>
              <description>An event or an error not covered by specific events has occurred. Check EVENTCAUSE register to find the cause.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_EP0SETUP</name>
          <description>A valid SETUP token has been received (and acknowledged) on the control endpoint</description>
          <addressOffset>0x15C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_EP0SETUP</name>
              <description>A valid SETUP token has been received (and acknowledged) on the control endpoint</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_EPDATA</name>
          <description>A data transfer has occurred on a data endpoint, indicated by the EPDATASTATUS register</description>
          <addressOffset>0x160</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_EPDATA</name>
              <description>A data transfer has occurred on a data endpoint, indicated by the EPDATASTATUS register</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
